Config/Documents/РешениеОбОценкеИмуществаМЗИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РешениеОбОценкеИмуществаМЗИК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаОСогласовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОСогласовании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОСогласовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостоянноДействующиеКомиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦМО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяАналитикаСчета</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокЭксплуатации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СправедливаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределенаОценщиком</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодРыночныхЦен</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыОпределенияРыночныхЦенПриОценкеСтоимостиИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезолюцияКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РезолюцияКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отсутствует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтсутствия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКБК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>гКБК</Name>
					<Comment>Глава по БК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРБ</Name>
					<Comment>Классификация расходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДБ</Name>
					<Comment>Классификация доходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИФ</Name>
					<Comment>Классификация источников финансирования дефицита бюджетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУИБУ</Name>
					<Comment>Для АУ и БУ начиная с 01.01.2017</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госуслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>Горюче-смазочные материалы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолоднякИЖивотныеНаОткорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МягкийИнвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Посуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПитания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стройматериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыРаспоряженияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРаспоряженияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаБалансе</Name>
					<Comment>Счета 101, 102, 103, 108</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперативныйУчет</Name>
					<Comment>Счета 21</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаХранении</Name>
					<Comment>Счета 02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоВПользование</Name>
					<Comment>Счета 01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВУправление</Name>
					<Comment>Счета 24</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВАренду</Name>
					<Comment>Счета 25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВПользование</Name>
					<Comment>Счета 26</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВЛичноеПользование</Name>
					<Comment>Счета 27</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РешениеОбОценкеИмуществаМЗИК/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			УстановитьРуководителя(Объект);
		КонецЕсли; 
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ); 
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьРуководителя(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		УстановитьЗаголовкиДинамическихКолонокСтроки(ТекущиеДанные);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.РешениеСотрудникаПоРезолюцииВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ЗаполнитьДанныеНоменклатурыВСтроке(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(Элемент, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииФлагаОтсутствуетЧленКомиссии(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииПричиныОтсутствияЧленаКомиссии(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СоставКомиссииВыборПоляУправленияФайлом(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект),
		Поле,
		СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииФайлОсобогоМненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ВыбратьФайлОсобогоМненияСотрудника(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект),
		СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииФайлОсобогоМненияОчистка(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ЗапроситьУдалениеФайлаЧленаКомиссии(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект),
		СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериаловРасширенный(ЭтотОбъект, Объект,,
		ДополнитьСтруктуруПодбора());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыТЧ(Команда)
	Реквизиты = Новый Структура(
		"СправедливаяСтоимость, ОпределенаОценщиком, ОценкаНомер, ОценкаДата, МетодРыночныхЦен");
	
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект,
		"РешениеОбОценкеИмуществаМЗИК",
		"Материалы",
		"Материалы",
		Реквизиты);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом 

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ТребуетсяВызовСервера = ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
			ЭтотОбъект.КэшПараметров.Дата,
			ЭтотОбъект.КэшПараметров.Организация,
			Объект.Дата,
			Объект.Организация);
	
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		ЗаполнитьПараметрыУчетаИК();
	КонецЕсли;

	УправлениеМатериальнымиЗапасами.ОбработатьИзменениеПримененияДетальногоКЭК340и440(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Дата,
		ЭтотОбъект.КэшПараметров.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(Элемент, СтандартнаяОбработка)
	ОграниченияКПС = Новый Массив;
	ОграниченияКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.АУИБУ"));
	ОграниченияКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	ОграниченияКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(
		Элемент,
		СтандартнаяОбработка,
		Новый Структура("КФО, КПС, Счет",
			ТекущиеДанные.КФО,
			ТекущиеДанные.КПС,
			ТекущиеДанные.СчетУчета),
		Объект.Организация,
		Объект.ИФО,
		Счет108(ЭтотОбъект),
		ТекущиеДанные.КФО,
		ОграниченияКПС,
		Объект.Дата,
		,
		ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Номенклатура"));
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьРуководителя(Объект);
	ЗаполнитьПараметрыУчетаИК();
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРуководителя(Объект)

	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель",
		Объект.Организация, Объект.Дата, Объект.Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
		И Объект.Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Объект.Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
		#Если НаКлиенте Тогда
		ПоказатьОповещениеПользователя(,,НСтр("ru = 'Установлено новое значение поля ""Руководитель""'"));			
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	СуммыНоменклатуры = СтоимостьНоменклатуры(СписокПодбора);
	СуммыНоменклатуры.Индексы.Добавить("Номенклатура, КФО");
	Отбор = Новый Структура("Номенклатура, КФО");
	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементПодбора);
		ЗаполнитьЗначенияСвойств(Отбор, ЭлементПодбора);
		Остатки = СуммыНоменклатуры.НайтиСтроки(Отбор);
		Если Остатки.Количество() > 0 И Остатки[0].Количество <> 0 Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Остатки[0], "СчетУчета, КПС, КЭК");
			Если НоваяСтрока.Количество = Остатки[0].Количество Тогда
				НоваяСтрока.Сумма = Остатки[0].Сумма;
			Иначе
				НоваяСтрока.Сумма = НоваяСтрока.Количество * Остатки[0].Сумма / Остатки[0].Количество;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		УстановитьЗаголовкиДинамическихКолонокСтроки(НоваяСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СтоимостьНоменклатуры(ТаблицаНоменклатуры)

	ПараметрыСтоимости = УправлениеМатериальнымиЗапасами.СтоимостьСписанияНеактивовНаЗабалансе_Параметры(Объект,
		УчетПоЦМО);
	ПараметрыСтоимости.СчетУчетаЗабаланс
		= ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет026");
	ПараметрыСтоимости.СчетаУчетаБаланс
		= БухгалтерскийУчет.СписокСчетов("108.50", Объект.Дата, Ложь, Объект.Организация);
	ПараметрыСтоимости.ТаблицаНоменклатуры = ТаблицаНоменклатуры;
	
	Возврат УправлениеМатериальнымиЗапасами.СтоимостьСписанияНеактивовНаЗабалансе(ПараметрыСтоимости);

КонецФункции

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",              ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет026"));
	ПараметрыПодбора.Вставить("Подразделение",			Объект.Подразделение);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");
	Возврат ПараметрыПодбора;

КонецФункции

&НаСервере
Процедура УстановитьДанныеДинамическихКолонок()

	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТаблицыМатериалы(
		ЭтотОбъект, Объект, "Материалы");
	УстановитьЗаголовкиДинамическихКолонок(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиДинамическихКолонок(Форма)
	Для Каждого Строка Из Форма.Объект.Материалы Цикл
		УстановитьЗаголовкиДинамическихКолонокСтроки(Строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиДинамическихКолонокСтроки(Строка)
	ЗаголовкиСтроки = Новый Структура;
	ЗаголовкиСтроки.Вставить("ЗаголовокМетодРыночныхЦен", НСтр("ru = 'Метод рыночных цен'"));
	ЗаголовкиСтроки.Вставить("ЗаголовокОтчетОценщика", НСтр("ru = 'Отчет оценщика №'"));
	ЗаголовкиСтроки.Вставить("ЗаголовокОтчетОценщикаДата", НСтр("ru = 'от'"));
	ЗаполнитьЗначенияСвойств(Строка, ЗаголовкиСтроки);
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
	УстановитьДанныеДинамическихКолонок();
	ЗаполнитьПараметрыУчетаИК();
	РаботаСФайламиБГУ.ЗаполнитьФайлыСотрудниковВТаблице(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыУчетаИК()
	ПараметрыУчетаИК = УправлениеМатериальнымиЗапасами.ПараметрыУчетаИКпоЦМОиПодразделениям(
		ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет108"),
		Объект.Организация,
		Объект.Дата);
	УчетПоПодразделениям = ПараметрыУчетаИК.УчетПоПодразделениям;
	УчетПоЦМО = ПараметрыУчетаИК.УчетПоЦМО;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКЭШПараметровФормыЛокальныеСчета()
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчета = Объект.Дата;
	Иначе
		ДатаСчета = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет108",
		БухгалтерскийУчет.СчетПоКоду("108.00", ДатаСчета, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет026",
		БухгалтерскийУчет.СчетПоКоду("02.6", ДатаСчета, Объект.Организация));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Счет108(Форма)
	Возврат ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(
		Форма,
		"Счет108",
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеНоменклатурыВСтроке(ИдентификаторСтроки, Знач ЗаполнятьСчет)
	
	ТекущиеДанные = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, ТекущиеДанные, ЗаполнятьСчет);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.ЗаполнятьСчет = ЗаполнятьСчет;
	ПараметрыОбработки.ДтКт          = "Дт";
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериалов(ЭтотОбъект, "Материалы");
	УстановитьУсловноеОформлениеЭлементовСпискаВыбора(Элементы.МатериалыОпределенаОценщиком);
	
	// Определение стоимости

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокМетодРыночныхЦен.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыМетодРыночныхЦен.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ОпределенаОценщиком", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокОтчетОценщика.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыОценкаНомер.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокОтчетОценщикаДата.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыОценкаДата.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ОпределенаОценщиком", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ОбщегоНазначенияБГУ.УстановитьУсловноеОформлениеКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЭлементовСпискаВыбора(Элемент)
	
	Для Каждого ЭлементСписка Из Элемент.СписокВыбора Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элемент.Имя);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, Элемент.ПутьКДанным,
			ВидСравненияКомпоновкиДанных.Равно, ЭлементСписка.Значение);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементСписка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	//Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
	//	СтруктураРеквизитов.Вставить("ИФО");
	//КонецЕсли;
	//Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям Тогда
	//	Если Элементы.Подразделение.ОтметкаНезаполненного Тогда
	//		СтруктураРеквизитов.Вставить("Подразделение");
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО"			, Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("Подразделение"	, Объект.Подразделение);
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
	ПараметрыПодбора.Вставить("НужнаАмортизация", Истина);
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("СкрытьКолонки", "КФО,КПС,СчетУчета,ЦМО");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(Знач ВыбранноеЗначение)
	
	ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(
		Объект.Материалы, ВыбранноеЗначение, , "ОсновноеСредство,ИнвентарныйНомер");
	
	Для Каждого НоваяСтрока Из ДобавленныеСтроки Цикл
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()
	
	ТаблицаОС = Объект.Материалы.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);
	
КонецФункции

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
